class MilitaryUnits {
  static const List<String> units = [
    "الإدارية",
    "التسليح",
    "الفنية",
    "المحروقات",
    "العمليات",
  ];

  /// 🪖 الرتب العسكرية مرتبة من الأدنى إلى الأعلى
  static const List<String> ranks = [
    "جندي",
    "عريف",
    "رقيب",
    "رقيب أول",
    "مساعد",
    "مساعد أول",

    "ملازم",
    "ملازم أول",
    "نقيب",
    "رائد",

    /// 🪖 رتب ميدانية عليا (قد تكون ركن)
    "مقدم",
    "مقدم ركن",
    "عقيد",
    "عقيد ركن",
    "عميد",
    "عميد ركن",
    "لواء",
    "لواء ركن",
  ];
}
